import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-distorted-channel',
  templateUrl: './distorted-channel.component.html',
  styleUrls: ['./distorted-channel.component.sass','../channel/channel.component.sass', '../home/home.component.sass']
})
export class DistortedChannelComponent implements OnInit {

  constructor() { }

  ngOnInit(): void {
    alert("Ỵ̴̧̢̛̺̤̮͖͇͕̭͉̹̳̱̻̰̗̬͎̲̘͍̻̫̤̥̞͔̗̼̩̩͙̪̯̯̥̭͈͐̎̆͒̈́̊̿̅̈́̑̊̆̏̈́̈̒̆̏̒̉̃͌͑͐̌̈́̀̈́͂̍́́̾̓̈́̌͌̒̐̈́͊̓̈́͂̑̏̆̑̉̀̋̆́̔͗̔̈́̉͑̍̈́̓̂͌̔͐̓̇̂̋̽͑͘̕͘̚͜͝͝͠͝͝͠͝͠͠ͅƠ̸̡̢̨̢̢̢̧̧̢̛̙̙͔͍͚̬̝̦͔̞͕̬̮̘̰̙̰͎̮̫̳̦͎̞̻̫̰̥̻͙͖̹͍͉͎̟͎͓̗̳̘͈̘͕̪͍̞̠͎̩̠̦̙̣̘̫̖̯̝̙͍̫̙̫͎̘̮̝͉͖̫͕̗̳̠̹̙̲̝̼͔̫̮̟̺̐͆̽͒̅͐̆̈́͋̂̄̆͌͆̔̓̃̽̓̑͋̑̅͆̓̌̾̄̍̐̎̿̏̏̈́̽́͂͋̑͊̂̉̈̉̐̌̍͛̌̉͋̈́͂̂̓̉̅͆͑̓̂͒̊͆̈́̈́́̑̀̄͑̀͐́̒̊́́͑̚̚͘͘͘̚͜͠͝͝͝͠Ų̷̡̨̨̢̢̨̢̛̛̳̲͈͉̝̭͖̘̥̩̫̹̣͉̬̫̣̝͖̱͙̮̮̤͕̬̳̖̣̜̬̦͖̫̦̩͇͎̼̹̙̼̦͚̖̞̲͖͚̪̲͍̮͈͚̙̱̩̯͔̹͈̘͙͔͎̟̮̱͕͈̥͈͇̦͖̘̝̟̲͔̝͎̣̑̊̈́̓̾͊̊̓̃̾̈́͑̃̒̒̅͒̄́̔̌̅͒́̈̈́͌̑̃̋̐̒̏̔̈͌͛̀̿̊̀̔̋̈́͋̾̓̏́̇́́̓̍̈́̇̈́̄̊͑̈́̉̄̏͆̎̽͂̋̓̋̑̓̇́̅͐̈́̍͆̉̏̊͑̂̕̕͘̚̕͘͜͜͜͝͠͝͝͠ͅͅͅͅͅ ̶̨̢̢̧̢̡̧̢̛̪̟̭̖̰̼̪̟̭͍͈̼̺̭͔̲̝̗͎̫̫̪̜̭̳̹̳̪̲͇͕̣͇͓̱͙̲̬̞̥̙͈͓̪̜͓͉̱̰̑͗̀̈́̿͐́́̅̂͋̍̋͂̐̌͆̈͗͑͋͌̋̉̉̽͑́̾̍̕̚̚͜͜͠͝ͅẄ̵̧̨̢̡̢̧̡̡̛͔͓̺̲̠̣̩͎͔͖͇̖̰͙̖̘͙͕͙̹̲̪̲͕͙̘͎̥̭̠̥̤̫̞̗̥̗͍̤͙͖̩̖͚̗̙̩̝̤̹̥̗̦̝̖̣̼̘̜̝͖͎̜̹͎́̈̀̆̎͒̅̓̈́̑̉͊͌̂͆̉̿̂͌̑̐̓̽̋̄̀͂̏̎̒͛̄͒̆́́͋̎̅̍̂̃͛̍͋͑͐͆͊̑͋͑̋̉̓͗̀̽͆͌̋̆̀́͒͌͊͑̎͑̕͘͘̚̕͘͝͝͠͠͝͠Į̵̡͈͍̺̲͙͍̼̝͙̻̘̎̿̇͛̓͒̓̓̓̂̄̀̅͛͒̌͒̔̋̅̊̋̆̔L̶̢̛̛͙̦̟̇̃̃̉̏̀͂̽̈́̔̇̋͊̓̈́̈́͒̋̂̅̐̔̒͊͆͂̽̀̇̒͆͂̐͆̊̒̏̈́̃̔̅̀̍̑͗͂̌̅͒̐͆͑͋́͊́̐̌́́̑͆̂̓̾́̎̾̿̆̐̅́̊̐͗͑̈̀̋̾̚͘̚͘̚̕͠͝͝͝͝͠͝͠L̷̡̢̡̨̡̨̨̧̨̡̛͓̼̮̲̟̲̥̝̫͚̗͙̠̬̼̞̳̥͖̰͇̰͚̭̱͍̥̘̱͓̯̰̰͙̻̭̯̦͓̲̠̱͓̙̼̬̙̺̻̬̱̜̬̟̗̗͍̩̘̟̝̤̼̯͈̞̩̙̭͈̩̹͙̥̹̝̪̰̥͇̥̎̎͆̓́̅̀̐̌͌̈͜͜͝ͅ ̶̧̢̡̛͙͈͉̘͕̱̤̟̬͙̪̰̬̙̫̖̳̆̓̓̃͂͋͊̉̂̽̔͌̈̂̔͋̅͂̈́̎̿̈̍̂̋̄̀͛͛̈́̀̅̉̎̈́̀͆̾́͆̌̄̉̈̈̃̀̄̎̀̇̎͗̈́͑̉̂̽̎̍̈́̉̾͆͘̚̚̚͘̚͘̕͠͝͝Ḑ̴̧̨̨̧̧̨̡̢̡̢̩͉̼̳̼̪̤̬͍̹̬͉̹̪̯̖̰̤̖̭̼̪͎͈̟̪̣͚̣̯͚̹̙̞͚̰̯̼̪̪̥̬͚̹̠͍̳̥̰̯̭̘̰̣̯̻̹̥̘̳̙͚̠̫̖̂̿̋̂̒̂̈̎̉́̿͊́͛͗͒͛̔́̌̍̐͋̀̋̒̈̋̊̓̾̂̐̓̂́̈̾̽͐̒̑̀̓̏̌̈̄̌̿̓̀͂̓̈͛̆́͋̐̿̑̈́͑͂́̄̊̀̄͐͆́͑͂͘͘͘̚͘͘̕̚͜͜͝͠͠͝͝͝͠͝ͅͅĮ̶̨̢̡̡̨̛̛̛̛̛̯̦̞̭̭̜͖̩̘͈͙̝͔̖͇̥̼͎̦̠͔̗͈̟̬͔͚̬̬͖͖̤̖̣͕̩͚̖̫͈͔̼̱̮̰̫̥͇͕̩̥̠̙̗̠̲̰͎̘͚̬̰͕̄̆̈́̐̏͗̈́̇̍͐̆͌̇͒͒̓́̓̋̎͋͛̇̂͒͂͑͂̋́̽͋̔̈́̈́͐̓̍̿̀̉̂̽̈́̿͌́̄͂̿͂̔̚̚̕̕̚͘͜͜͝͝͠͠͠ͅE̸̛̛̛͎̬̱̭͖̯̘͑̎̐͆̀͆̉̀̈́̂̍̊̈́̈́̍̀͆̅̽̑̄̈̽̿̄̀̎͊̈̄̓̾͛̏̐͒̚̕̚͝͠ ̵̧̢̢̧̨̨̢̨̬͚̰̹͈̜͓͕̣͉̮̞̱̞̭̮̩̤̬̖̤͍̳̘̳̲̱̝͕̼͓̳̮̯̳̻͚͖̜̱̼͎͊͐̏͋̈͋͆́̾̄́̋̀̂͑̀̆̇̀͆͒̅̀̒̽̒̀̔̇̿̈́̓̎̀̈́͐̆̃̊̃̽̎̏̎̾́̈́̓̋͋͗̀̚͘̕̕͘͜͝͝͝͝͝ͅͅͅͅ•̶̨̛̮̰̪̼̣͇̣̗̞͓͎̪̩̺̱͕̫͚̦͚̝̖͉̈́̑̉̋̉̃͋̓̉͗̔̋̑̊̍̃̀̔̃͗̑̑̕͠͠͝͝ͅ ̴̨̩͎͗̈͋̎̅̾̓̽̈́͌̀̓̋͑̇̈́̃̊̾͠͝͝Ţ̷̡̧̛̛̛͔̣͍̖̭̖̠͉̮̱̥͎͚͇̳̱̥͙͙̮͕̬̻̹͙͖̞̝͎̈́̍̿̄͆͑̂̾͗͌̏͌̋̐̈́͌̄̔̍̎̓̍̀͂͑̀̿̐̐̍͌̉͐̎̉̐̉̍̋̑̉̍̍̆̀̋̎̽̀̑̃͌̋̀̀̓̅̇́̓͘̚̕̚̚͝͠͝Ơ̴̥̟̬̺͓̯̔̅̾̑ͅN̵̨̛̗̱̗͚̤͙͚̑͂̈́͌̄̐̈́͐̿̄̾̎̈̊̉̓͆̍̒͗͌̿̎͂̓͗̔̈̈́̐̈́̈́͑̽̾̂̈̌̿̓̍̿̅̿̾̔̇̎̉̓͒̇̓͂̀͂̈́͛̈́̾̉͂͆̇̏̀̂̄̚̚͘͘͠͠͝͝͝I̷̢̢̨̧̧̡̡̧̨̡̢͔̩̳͍̱͍̘͇̠̻̗̜͈̝͖̙̜͚̭̭̭̤̼͔͇̰̲̦͓̮̦̮̳̞͉͔̠͙̬̤̙̹͚͍̤̤̯̪̻̜͙̲̣͔͈͈͍͓͈̮͙̣̻̯̻̜̱͓͙̩̘̻̝͔̟̬̻̞̅̇̐̌̇́̑̂͊͊̂͋͐̽̂͌̀̍͆͊̓̽͘͜͜͜ͅĢ̴̢̛̛̛̞͓̤̬̲͎̺̝̠͎͈̙̙͕͚̼̠̙̣̯̀̒̀͋̓͊̇͒͛͆̈́̀͊̔̏͂̉͌̍͋̒̅̍̀̾̔̃͗̄̋̄́̈͌̎͒͗̒̽̿͛̀̍̆͊̃͋̿̈́̽̊͑̿͒̆̀̊̿͗̐̃͒̋̑̍̋̇͐̑̀͘͘̚̚̚̚͘͘͠͝͝͝͝͠H̴̛̛̛̛͕͈̙̲͓̻̖̞̅͑̾͌̇̓̊̑͂͂̒̊́̄̊̒̉̽̈́̐͑͑̾̍̈́̃͗̆̔̈̂͋͋̑͐́̄͑̆̀̀͋́̿̐̀͆͐̈͗͊͊͐̉̆́͑̿̆̅̃̋̌̋͗̽͆͑̒̏̋̃̓̓̋̒͛́̏̄̈́̃͑̍̊̉̏͆͛̊̚͘̕̚͝͝͠͝͠͝͝Ţ̸̨̧̨̼̳̜̳̺͙͉̩̟̬̗͖̗͓̘̟̰̳͚̬̲͍͖͙̏̽̽̇̅͒̄̑̍̉͐̅͘͘͘̕");
  }

}
